_posts/2014-10-17-Generate-emacs-lisp-documentation.html
---
title: Generate emacs-lisp documentation
date: 2014/10/17 14:39:49
updated: 2014/10/17 14:39:49
categories: emacs_lisp
tags: 
---



<p>
Emacs has some pretty amazing features to get help on a function (describe-function), to navigate quickly to functions in an elisp file (speedbar and imenu). Other languages have tools for generating documentation for all the functions in a file, e.g. epydoc, javadoc, Doxygen,&#x2026; I have not found an equivalent to this in emacs-lisp. Here, we explore some options to get something similar to this. Our goal will be to take an emacs-lisp file, and generate an org-file of documentation, and then convert that to PDF for reading.
</p>

<p>
Say we have a function, jmax-bibtex-next-entry, and we want some information about it. Here are three functions that give us the argument list, documentation string, and function definition.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(help-function-arglist 'jmax-bibtex-next-entry)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">&amp;optional</td>
<td class="left">n</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(documentation 'jmax-bibtex-next-entry)
</pre>
</div>

<pre class="example">
Jump to the beginning of the next bibtex entry. N is a prefix
argument. If it is numeric, jump that many entries
forward. Negative numbers do nothing.
</pre>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(symbol-function 'jmax-bibtex-next-entry)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">lambda</td>
<td class="left">(&amp;optional n)</td>
<td class="left">Jump to the beginning of the next bibtex entry. N is a prefix\nargument. If it is numeric, jump that many entries\nforward. Negative numbers do nothing.</td>
<td class="left">(interactive P)</td>
<td class="left">(if (= (point) (save-excursion (bibtex-beginning-of-entry))) (progn (forward-char) (bibtex-next-entry)))</td>
<td class="left">(if (re-search-forward bibtex-entry-head nil t (and (numberp n) n)) (progn (bibtex-beginning-of-entry)))</td>
</tr>
</tbody>
</table>

<p>
That will not always be the code we wrote, but it is functionally similar.
</p>

<p>
So we could create an org-entry like this:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">fun2org</span> (function-symbol)
  (<span style="color: #8b0000;">let</span> ((args (help-function-arglist function-symbol))
        (doc  (documentation function-symbol))
        (code (symbol-function function-symbol)))
    (format <span style="color: #228b22;">"** %s %s</span>
<span style="color: #228b22;">%s</span>

<span style="color: #228b22;">#+BEGIN_SRC emacs-lisp</span>
<span style="color: #228b22;">%S</span>
<span style="color: #228b22;">#+END_SRC</span>
<span style="color: #228b22;">"</span> function-symbol args doc code)))

(fun2org 'jmax-bibtex-next-entry)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-org"><span style="color: #8b008b;">** jmax-bibtex-next-entry (&amp;optional n)</span>
Jump to the beginning of the next bibtex entry. N is a prefix
argument. If it is numeric, jump that many entries
forward. Negative numbers do nothing.

<span style="color: #ff0000; font-weight: bold;">#+BEGIN_SRC emacs-lisp</span>
<span style="background-color: #b0c4de;">(</span><span style="color: #8b0000; background-color: #b0c4de;">lambda</span><span style="background-color: #b0c4de;"> (</span><span style="color: #4682b4; background-color: #b0c4de;">&amp;optional</span><span style="background-color: #b0c4de;"> n) </span><span style="color: #228b22; background-color: #b0c4de;">"Jump to the beginning of the next bibtex entry. N is a prefix</span><span style="background-color: #b0c4de;">
</span><span style="color: #228b22; background-color: #b0c4de;">argument. If it is numeric, jump that many entries</span><span style="background-color: #b0c4de;">
</span><span style="color: #228b22; background-color: #b0c4de;">forward. Negative numbers do nothing."</span><span style="background-color: #b0c4de;"> (interactive </span><span style="color: #228b22; background-color: #b0c4de;">"P"</span><span style="background-color: #b0c4de;">) (</span><span style="color: #8b0000; background-color: #b0c4de;">if</span><span style="background-color: #b0c4de;"> (= (point) (</span><span style="color: #8b0000; background-color: #b0c4de;">save-excursion</span><span style="background-color: #b0c4de;"> (bibtex-beginning-of-entry))) (</span><span style="color: #8b0000; background-color: #b0c4de;">progn</span><span style="background-color: #b0c4de;"> (forward-char) (bibtex-next-entry))) (</span><span style="color: #8b0000; background-color: #b0c4de;">if</span><span style="background-color: #b0c4de;"> (re-search-forward bibtex-entry-head nil t (and (numberp n) n)) (</span><span style="color: #8b0000; background-color: #b0c4de;">progn</span><span style="background-color: #b0c4de;"> (bibtex-beginning-of-entry))))
</span><span style="color: #ff0000; font-weight: bold;">#+END_SRC</span>
</pre>
</div>

<p>
The code is not that beautifully indented, but it is optional. 
</p>

<p>
For variables, there are similar functions to get their documentation:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(documentation-property 'jmax-bibtex-journal-abbreviations 'variable-documentation)
</pre>
</div>

<pre class="example">
List of (string journal-full-name journal-abbreviation). Find abbreviations at http://cassi.cas.org/search.jsp.
</pre>

<p>
The problem still is, you have to know the variable and function names in advance. I want to take a file, and generate this for each function, and variable. 
</p>

<p>
I posted a question on <a href="http://stackoverflow.com/questions/26330363/how-do-i-get-a-list-of-functions-defined-in-an-emacs-lisp-file/26360946?iemail=1&noredirect=1#26360946">StackOverflow</a> on how to get the functions defined in a file. The most feasible suggestion was to use the variable load-history, which contains a history of the variables and functions loaded, and the files they are in.
</p>

<p>
Here is an example of getting the entries associated with jmax-bibtex.el
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(cdr (assoc <span style="color: #228b22;">"/Users/jkitchin/Dropbox/kitchingroup/jmax/jmax-bibtex.el"</span> load-history ))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(jmax-bibtex-journal-abbreviations
 (<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">.</span> jmax-bibtex-generate-longtitles)
 (<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">.</span> jmax-bibtex-generate-shorttitles)
 (<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">.</span> jmax-stringify-journal-name)
 (<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">.</span> jmax-set-journal-string)
 jmax-nonascii-latex-replacements
 (<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">.</span> jmax-replace-nonascii)
 jmax-lower-case-words
 (<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">.</span> jmax-title-case-article)
 (<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">.</span> jmax-sentence-case-article)
 (<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">.</span> jmax-bibtex-next-entry)
 (<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">.</span> jmax-bibtex-previous-entry)
 (<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">.</span> jmax-bibtex-mode-keys)
 (<span style="color: #8b0000;">provide</span> <span style="color: #cd0000;">.</span> jmax-bibtex))
</pre>
</div>

<p>
Each element in this case is either a variable, defun or provide. Here, we can use this to print some information about the variables defined in this file. I think it is sufficient to check if the element in the list is a symbol, because all the other elements are cons elements. I suppose there are other possibilities, including defcustom, defgroup, defalias, defsubst, and maybe others.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">dolist</span> (element (cdr
                  (assoc
                   <span style="color: #228b22;">"/Users/jkitchin/Dropbox/kitchingroup/jmax/jmax-bibtex.el"</span>
                   load-history )))
  (<span style="color: #8b0000;">when</span> (symbolp element)
    (princ 
    (format <span style="color: #228b22;">"%s</span>
<span style="color: #228b22;">Documentation: %s</span>

<span style="color: #228b22;">"</span> element (documentation-property element 'variable-documentation)))))
</pre>
</div>

<pre class="example">
jmax-bibtex-journal-abbreviations
Documentation: List of (string journal-full-name journal-abbreviation). Find abbreviations at http://cassi.cas.org/search.jsp.

jmax-nonascii-latex-replacements
Documentation: Cons list of non-ascii characters and their LaTeX representations

jmax-lower-case-words
Documentation: List of words to keep lowercase
</pre>

<p>
We can handle functions by checking if an element is a cons cell with a first element of defun.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">dolist</span> (element (cdr
                  (assoc
                   <span style="color: #228b22;">"/Users/jkitchin/Dropbox/kitchingroup/jmax/jmax-bibtex.el"</span>
                   load-history )))
  (<span style="color: #8b0000;">when</span> (and (consp element)
             (eq (car element) 'defun))
    (princ (format <span style="color: #228b22;">"%s is a function\n"</span> (cdr element))))))
</pre>
</div>

<pre class="example">
jmax-bibtex-generate-longtitles is a function
jmax-bibtex-generate-shorttitles is a function
jmax-stringify-journal-name is a function
jmax-set-journal-string is a function
jmax-replace-nonascii is a function
jmax-title-case-article is a function
jmax-sentence-case-article is a function
jmax-bibtex-next-entry is a function
jmax-bibtex-previous-entry is a function
jmax-bibtex-mode-keys is a function
</pre>


<p>
So, we have the important pieces to mash up what I am looking for. Let us refine the goal. I want to create a PDF documentation of what is in an elisp file with a section on variables, and a section on functions. 
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">let*</span> ((elements (cdr
                  (assoc
                   <span style="color: #228b22;">"/Users/jkitchin/Dropbox/kitchingroup/jmax/jmax-bibtex.el"</span>
                   load-history)))
       (vars (-filter 'symbolp elements))
       (funcons (-filter (<span style="color: #8b0000;">lambda</span> (x)
                           (and (consp x)
                                (eq 'defun (car x))))
                         elements))
       (funcs (mapcar 'cdr funcons)))
  (switch-to-buffer <span style="color: #228b22;">"*org-doc*"</span>)
  (erase-buffer)
  (insert (format <span style="color: #228b22;">"#+TITLE: Documentation for %s</span>
<span style="color: #228b22;">#+OPTIONS: toc:nil</span>
<span style="color: #228b22;">\\maketitle</span>
<span style="color: #228b22;">\\tableofcontents</span>
<span style="color: #228b22;">"</span> <span style="color: #228b22;">"/Users/jkitchin/Dropbox/kitchingroup/jmax/jmax-bibtex.el"</span>))
  (insert <span style="color: #228b22;">"* Variables\n"</span>)
  (<span style="color: #8b0000;">dolist</span> (var (sort vars 'string-lessp))
    (insert (format <span style="color: #228b22;">"** %s</span>
<span style="color: #228b22;">Documentation: %s\n\n"</span> var  (documentation-property var 'variable-documentation))))

  (insert <span style="color: #228b22;">"* Functions\n\n"</span>)
  (<span style="color: #8b0000;">dolist</span> (funcs (sort funcs 'string-lessp))
    (insert (format <span style="color: #228b22;">"** %s %s</span>
<span style="color: #228b22;">Documentation: %s</span>

<span style="color: #228b22;">Code:</span>
<span style="color: #228b22;">#+BEGIN_SRC emacs-lisp</span>
<span style="color: #228b22;">%S</span>
<span style="color: #228b22;">#+END_SRC</span>
<span style="color: #228b22;">"</span>
                    funcs
                    (or (help-function-arglist funcs) <span style="color: #228b22;">""</span>)
                    (documentation funcs)
                    (symbol-function funcs))))

  (org-mode)
  (write-file <span style="color: #228b22;">"jmax-bibtex-doc.org"</span>)
  (org-export-to-file 'latex <span style="color: #228b22;">"jmax-bibtex-doc.tex"</span>)
  (org-latex-compile <span style="color: #228b22;">"jmax-bibtex-doc.tex"</span>)
  (kill-buffer <span style="color: #228b22;">"*org-doc*"</span>)
  (kill-buffer <span style="color: #228b22;">"jmax-bibtex-doc.org"</span>))
</pre>
</div>

<p>
Here is the resulting pdf: <a href="/media/2014-10-17-Generate-emacs-lisp-documentation/jmax-bibtex-doc.pdf">jmax-bibtex-doc.pdf</a> . It is not too bad. The code is not beautiful, and it would take some work to get that looking nice. It might be nice to find all instances of '` and replace them with links to variable names, but I leave that for another day. There is also no information about the header comments, but I leave this for another day to.
</p>
<p>Copyright (C) 2014 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2014/10/17/Generate-emacs-lisp-documentation.org">org-mode source</a><p><p>Org-mode version = 8.2.7c</p>